## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudfront_function.web_response will be destroyed
  # (because aws_cloudfront_function.web_response is not in configuration)
-   resource "aws_cloudfront_function" "web_response" {
-       arn             = "arn:aws:cloudfront::357150818708:function/cpfreporter-cpf_reporter_web_response" -> null
-       code            = <<-EOT
            function handler(event) {
              var response = event.response;
              response.headers = Object.assign({}, {
              "x-frame-options": {
                  "value": "SAMEORIGIN"
              },
              "x-content-type-options": {
                  "value": "nosniff"
              },
              "x-xss-protection": {
                  "value": "1; mode=block"
              },
              "strict-transport-security": {
                  "value": "max-age=63072000"
              }
            }, response.headers);
              return response;
            }
        EOT -> null
-       comment         = "CPF Reporter web response." -> null
-       etag            = "E3UN6WX5RRO2AG" -> null
-       id              = "cpfreporter-cpf_reporter_web_response" -> null
-       live_stage_etag = "E3UN6WX5RRO2AG" -> null
-       name            = "cpfreporter-cpf_reporter_web_response" -> null
-       publish         = true -> null
-       runtime         = "cloudfront-js-1.0" -> null
-       status          = "DEPLOYED" -> null
    }

  # aws_cloudfront_function.web_uri_rewriter will be destroyed
  # (because aws_cloudfront_function.web_uri_rewriter is not in configuration)
-   resource "aws_cloudfront_function" "web_uri_rewriter" {
-       arn             = "arn:aws:cloudfront::357150818708:function/cpfreporter-web_uri_rewriter" -> null
-       code            = <<-EOT
            function handler(event) {
                var request = event.request;
                var uri = request.uri;
            
                if (uri.endsWith('/')) {
                    request.uri += 'index.html';
                } else if (!uri.includes('.')) {
                    request.uri += '/index.html';
                }
            
                return request;
            }
        EOT -> null
-       comment         = "Rewrites URIs to be SPA-friendly." -> null
-       etag            = "ETVPDKIKX0DER" -> null
-       id              = "cpfreporter-web_uri_rewriter" -> null
-       live_stage_etag = "ETVPDKIKX0DER" -> null
-       name            = "cpfreporter-web_uri_rewriter" -> null
-       publish         = true -> null
-       runtime         = "cloudfront-js-1.0" -> null
-       status          = "UNASSOCIATED" -> null
    }

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:13" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:13" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6dc560a404e1e8c0bb97f40186cc3696-6" -> "c19ed0e22706ec44e64783b937281431"
      ~ id                     = "graphql.1d276b99bb0f526aafb09b78c35103bf.zip" -> (known after apply)
      ~ key                    = "graphql.1d276b99bb0f526aafb09b78c35103bf.zip" -> "graphql.c19ed0e22706ec44e64783b937281431.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "1d276b99bb0f526aafb09b78c35103bf" -> "c19ed0e22706ec44e64783b937281431"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "U0jZ6tcNZqu0FvgPfuzZHkgQ7nFYhvrp" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ea0eadbb11a2d33889d223f2026bf0e9" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/200.html"
      ~ source_hash            = "ea0eadbb11a2d33889d223f2026bf0e9" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "7Bywq45f5VOgGSNWbN2Hp3OrMcsjRgiR" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2aa00dfaf11eafbd91674904017a14ec" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "2aa00dfaf11eafbd91674904017a14ec" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        tags                   = {}
      ~ version_id             = "HasVLvu5MK2GALT00SI0t4lBQlPp5u0t" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f0d6cbd31a30ff7692f9f2fb43cafd71" -> "54f38202789932549d203cfac8d15867"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "f0d6cbd31a30ff7692f9f2fb43cafd71" -> "54f38202789932549d203cfac8d15867"
        tags                   = {}
      ~ version_id             = "EFQ9Ki9P818XJ4alPgfygCqpFTg9kQl1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ea0eadbb11a2d33889d223f2026bf0e9" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/index.html"
      ~ source_hash            = "ea0eadbb11a2d33889d223f2026bf0e9" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "t5R7CsIInNhN3o0ly_O3EojY.9X__LiG" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.5b610184.js"] will be destroyed
  # (because key ["static/js/app.5b610184.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "83f6b287e2d15fd9e409e7655fd53f18" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.5b610184.js" -> null
-       key                    = "dist/static/js/app.5b610184.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.5b610184.js" -> null
-       source_hash            = "83f6b287e2d15fd9e409e7655fd53f18" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "gSyL8xdUpuK4NDjKZdRe8QHsgbIwjOvu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.5b610184.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.5b610184.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.5b610184.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.5b610184.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.5b610184.js.LICENSE.txt" -> null
-       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "7ckS4_osTCoMa.34j.mdp06YIPxbLHq2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "dd42626cf22d4c58fc5e205928b29a40"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js"
+       source_hash            = "dd42626cf22d4c58fc5e205928b29a40"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js.LICENSE.txt"
+       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E10LD7TGHC4SRE"
        tags                           = {}
        # (21 unchanged attributes hidden)

-       custom_error_response {
-           error_caching_min_ttl = 0 -> null
-           error_code            = 404 -> null
-           response_code         = 200 -> null
-           response_page_path    = "/index.html" -> null
        }
+       custom_error_response {
+           error_code         = 403
+           response_code      = 403
+           response_page_path = "/errors/403.html"
        }
+       custom_error_response {
+           error_code         = 404
+           response_code      = 404
+           response_page_path = "/errors/404.html"
        }

      ~ default_cache_behavior {
            # (12 unchanged attributes hidden)

-           function_association {
-               event_type   = "viewer-response" -> null
-               function_arn = "arn:aws:cloudfront::357150818708:function/cpfreporter-cpf_reporter_web_response" -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-09T04:21:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:31" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:31/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.1d276b99bb0f526aafb09b78c35103bf.zip" -> "graphql.c19ed0e22706ec44e64783b937281431.zip"
        tags                           = {}
      ~ version                        = "31" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "b327df650136347931ad713ae796b0c615a4625e" -> "f2db323731265f0bdd8d826e85459b8e3e2dc5b7"
              ~ "DD_TAGS"                            = "git.commit.sha:b327df650136347931ad713ae796b0c615a4625e,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:f2db323731265f0bdd8d826e85459b8e3e2dc5b7,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "b327df650136347931ad713ae796b0c615a4625e" -> "f2db323731265f0bdd8d826e85459b8e3e2dc5b7"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "31" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 7 to change, 7 to destroy.
```

</details>

*Pusher: @dysmento, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7151879061)*